In [2]:
import pandas as pd
import numpy as np
# where method()

In [3]:
#np.random.normal() returns single value, pass this into a for loop to get multiple values
for i in np.arange(10):
    print(np.random.normal())

2.3512525889653944
-1.0670776061877074
-0.3494129284093058
1.054410233439274
1.7499844327067644
-1.0638690037150158
-0.19037707309132104
0.032477031580915715
-1.9818501883075625
-0.5793334821287444

In [4]:
round(np.random.normal(),3)  #3 limits the value after decimal value

0.624

In [5]:
[i for i in np.arange(10)]   #list comprehension

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [6]:
# inplace = True    updates the current dataframe after operation

In [38]:
stock_data = pd.read_csv('MoreStock.csv')
stock_data

   TradingDate PriceType   Nasdaq  S&P 500  Russell 2000
0   2014/02/21      open  4282.17  1841.07       1166.25
1   2014/02/21     close  4263.41  1836.25       1164.63
2   2014/02/21      high  4284.85  1846.13       1168.43
3   2014/02/24      open  4273.32  1836.78       1166.74
4   2014/02/24     close  4292.97  1847.61       1174.55
5   2014/02/24      high  4311.13  1858.71       1180.29
6   2014/02/25      open  4298.48  1847.66       1176.00
7   2014/02/25     close  4287.59  1845.12       1173.95
8   2014/02/25      high  4307.51  1852.91       1179.43
9   2014/02/26      open  4300.45  1845.79       1176.11
10  2014/02/26     close  4292.06  1845.16       1181.72
11  2014/02/26      high  4316.82  1852.65       1188.06
12  2014/02/27      open  4291.47  1844.90       1179.28
13  2014/02/27     close  4318.93  1854.29       1187.94
14  2014/02/27      high  4322.46  1854.53       1187.94
15  2014/02/28      open  4323.52  1855.12       1189.19
16  2014/02/28     close  4308.12  1859.45       1183.03
17  2014/02/28      high  4342.59  1867.92       1193.50

In [32]:
stock_data["PriceType"] == 'open'
#binary mask

0      True
1     False
2     False
3      True
4     False
5     False
6      True
7     False
8     False
9      True
10    False
11    False
12     True
13    False
14    False
15     True
16    False
17    False
Name: PriceType, dtype: bool

In [34]:
stock_data[stock_data["PriceType"] == 'open']

   TradingDate PriceType   Nasdaq  S&P 500  Russell 2000
0   2014/02/21      open  4282.17  1841.07       1166.25
3   2014/02/24      open  4273.32  1836.78       1166.74
6   2014/02/25      open  4298.48  1847.66       1176.00
9   2014/02/26      open  4300.45  1845.79       1176.11
12  2014/02/27      open  4291.47  1844.90       1179.28
15  2014/02/28      open  4323.52  1855.12       1189.19

In [42]:
stock_data.set_index(['TradingDate','PriceType']).head()

                        Nasdaq  S&P 500  Russell 2000
TradingDate PriceType
2014/02/21  open       4282.17  1841.07       1166.25
            close      4263.41  1836.25       1164.63
            high       4284.85  1846.13       1168.43
2014/02/24  open       4273.32  1836.78       1166.74
            close      4292.97  1847.61       1174.55

In [44]:
stock_data_db = stock_data.set_index(['TradingDate','PriceType'])

In [54]:
stock_data.head()

  TradingDate PriceType   Nasdaq  S&P 500  Russell 2000
0  2014/02/21      open  4282.17  1841.07       1166.25
1  2014/02/21     close  4263.41  1836.25       1164.63
2  2014/02/21      high  4284.85  1846.13       1168.43
3  2014/02/24      open  4273.32  1836.78       1166.74
4  2014/02/24     close  4292.97  1847.61       1174.55

In [64]:
stock_data[(stock_data['PriceType']=='open') | (stock_data['Nasdaq'] > 4750)]

   TradingDate PriceType   Nasdaq  S&P 500  Russell 2000
0   2014/02/21      open  4282.17  1841.07       1166.25
1   2014/02/21      open  4263.41  1836.25       1164.63
2   2014/02/21      open  4284.85  1846.13       1168.43
3   2014/02/24      open  4273.32  1836.78       1166.74
4   2014/02/24      open  4292.97  1847.61       1174.55
5   2014/02/24      open  4311.13  1858.71       1180.29
6   2014/02/25      open  4298.48  1847.66       1176.00
7   2014/02/25      open  4287.59  1845.12       1173.95
8   2014/02/25      open  4307.51  1852.91       1179.43
9   2014/02/26      open  4300.45  1845.79       1176.11
10  2014/02/26      open  4292.06  1845.16       1181.72
11  2014/02/26      open  4316.82  1852.65       1188.06
12  2014/02/27      open  4291.47  1844.90       1179.28
13  2014/02/27      open  4318.93  1854.29       1187.94
14  2014/02/27      open  4322.46  1854.53       1187.94
15  2014/02/28      open  4323.52  1855.12       1189.19
16  2014/02/28      open  4308.12  1859.45       1183.03
17  2014/02/28      open  4342.59  1867.92       1193.50

## using where() method

In [75]:
np.random.seed(100)
normvals = pd.Series([np.random.normal() for i in np.arange(10) ] )
print(normvals)

0   -1.749765
1    0.342680
2    1.153036
3   -0.252436
4    0.981321
5    0.514219
6    0.221180
7   -1.070043
8   -0.189496
9    0.255001
dtype: float64

In [77]:
normvals[normvals > 0]

1    0.342680
2    1.153036
4    0.981321
5    0.514219
6    0.221180
9    0.255001
dtype: float64

In [79]:
normvals.where(normvals>0)

0         NaN
1    0.342680
2    1.153036
3         NaN
4    0.981321
5    0.514219
6    0.221180
7         NaN
8         NaN
9    0.255001
dtype: float64

In [87]:
#working with DataFrame
np.random.seed(100)
normDf = pd.DataFrame([[np.random.normal() for i in np.arange(5)] for j in np.arange(3)], columns=['0','30','60','90','120'])
print(normDf)

          0        30        60        90       120
0 -1.749765  0.342680  1.153036 -0.252436  0.981321
1  0.514219  0.221180 -1.070043 -0.189496  0.255001
2 -0.458027  0.435163 -0.583595  0.816847  0.672721